alibaba/AliOS-Things/platform/board/frdmkl27z/pin_mux.h
/*! @name PORTA18 (number 32), EXTAL_32KHZ
  @{ */
#define BOARD_EXTAL0_PERIPHERAL OSC0     /*!<@brief Device name: OSC0 */
#define BOARD_EXTAL0_SIGNAL EXTAL0       /*!<@brief OSC0 signal: EXTAL0 */
#define BOARD_EXTAL0_PORT PORTA          /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U             /*!<@brief PORTA pin index: 18 */
#define BOARD_EXTAL0_PIN_NAME EXTAL0     /*!<@brief Pin name */
#define BOARD_EXTAL0_LABEL "EXTAL_32KHZ" /*!<@brief Label */
#define BOARD_EXTAL0_NAME "EXTAL0"       /*!<@brief Identifier name */
                                         /* @} */

/*! @name PORTA19 (number 33), XTAL_32KHZ
  @{ */
#define BOARD_XTAL0_PERIPHERAL OSC0    /*!<@brief Device name: OSC0 */
#define BOARD_XTAL0_SIGNAL XTAL0       /*!<@brief OSC0 signal: XTAL0 */
#define BOARD_XTAL0_PORT PORTA         /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U            /*!<@brief PORTA pin index: 19 */
#define BOARD_XTAL0_PIN_NAME XTAL0     /*!<@brief Pin name */
#define BOARD_XTAL0_LABEL "XTAL_32KHZ" /*!<@brief Label */
#define BOARD_XTAL0_NAME "XTAL0"       /*!<@brief Identifier name */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
